Revit 2027 API
ParameterTypeId.FabricationPrimarySize Property
 "Size of Primary End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPrimarySize { get; }
Public Shared ReadOnly Property FabricationPrimarySize As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPrimarySize {
	ForgeTypeId^ get ();
}
static member FabricationPrimarySize : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace